bierner.markdown-mermaid
charliermarsh.ruff
DavidAnson.vscode-markdownlint
eamodio.gitlens
EditorConfig.EditorConfig
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
foxundermoon.shell-format
gera2ld.markmap-vscode
GitHub.vscode-pull-request-github
golang.go
hashicorp.terraform
hoovercj.haskell-linter
justusadam.language-haskell
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode.cpptools
redhat.vscode-yaml
rust-lang.rust-analyzer
sumneko.lua
vadimcn.vscode-lldb
vscodevim.vim
yzhang.markdown-all-in-one
