bierner.markdown-mermaid
DavidAnson.vscode-markdownlint
eamodio.gitlens
EditorConfig.EditorConfig
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
GitHub.vscode-pull-request-github
golang.go
hashicorp.terraform
hoovercj.haskell-linter
justusadam.language-haskell
kosz78.nim
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-vscode.cpptools
ms-vsliveshare.vsliveshare
redhat.java
redhat.vscode-yaml
rust-lang.rust-analyzer
vadimcn.vscode-lldb
vscjava.vscode-java-debug
vscodevim.vim
yzhang.markdown-all-in-one
