alanz.vscode-hie-server
DavidAnson.vscode-markdownlint
eamodio.gitlens
EditorConfig.EditorConfig
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
GitHub.vscode-pull-request-github
golang.go
hashicorp.terraform
hoovercj.haskell-linter
justusadam.language-haskell
kosz78.nim
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode.cpptools
ms-vsliveshare.vsliveshare
redhat.java
redhat.vscode-yaml
rust-lang.rust
vadimcn.vscode-lldb
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
yzhang.markdown-all-in-one
