tap "github/gh"
tap "golangci/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "wez/wezterm"
brew "xz"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnutls"
brew "go"
brew "govulncheck"
brew "grpcurl"
brew "helm"
brew "hey"
brew "httpie"
brew "hugo"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "ldns"
brew "libgcrypt"
brew "lua-language-server"
brew "midnight-commander"
brew "neovim"
brew "node"
brew "openssh"
brew "pnpm"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "tree"
brew "watch"
brew "yamllint"
brew "yq"
brew "zoxide"
brew "golangci/tap/golangci-lint"
cask "cyberduck"
cask "dbeaver-community"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "insomnia"
cask "kap"
cask "keepassxc"
cask "qlmarkdown"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "wezterm-nightly"
cask "zoom"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "foxundermoon.shell-format"
vscode "gera2ld.markmap-vscode"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hoovercj.haskell-linter"
vscode "JohnnyMorganz.stylua"
vscode "justusadam.language-haskell"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"

# # Optional packages
# tap "adoptopenjdk/openjdk"
# tap "kubeshark/kubeshark"
# tap "osx-cross/arm"
# tap "osx-cross/avr"
# tap "qmk/qmk"
# tap "ankitpokhrel/jira-cli"
# tap "hashicorp/tap"
# brew "aerc"
# brew "coreutils"
# brew "hugo"
# brew "exercism"
# brew "ghz"
# brew "haskell-stack"
# brew "hlint"
# brew "helix"
# brew "k9s"
# brew "podman"
# brew "python-yq"
# brew "sops"
# brew "tfenv"
# brew "tflint"
# brew "tmux"
# brew "zola"
# cask "freecad"
# cask "swiftbar"
# cask "signal"
# cask "keycastr"
# brew "qmk/qmk/qmk"
# cask "spotify"
# cask "podman-desktop"
# cask "karabiner-elements"
# brew "hashicorp/tap/terraform-ls"
