tap "adoptopenjdk/openjdk"
tap "github/gh"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "wez/wezterm"
brew "aerc"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "libusb"
brew "gettext"
brew "coreutils"
brew "libtiff"
brew "exercism"
brew "fd"
brew "libtool"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnutls"
brew "libgcrypt"
brew "go"
brew "grafana", restart_service: true
brew "ghz"
brew "grep"
brew "haskell-stack"
brew "helix"
brew "helm"
brew "hlint"
brew "httpie"
brew "hugo"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "ldns"
brew "libpq", link: true
brew "libressl"
brew "libsodium"
brew "mcrypt"
brew "midnight-commander"
brew "neovim"
brew "nfpm"
brew "nim"
brew "node"
brew "openssh"
brew "pnpm"
brew "podman"
brew "python-yq"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "sops"
brew "tfenv"
brew "tflint"
brew "tmux"
brew "tree"
brew "watch"
brew "wireguard-tools"
brew "yamllint"
brew "zig"
brew "zola"
brew "golangci/tap/golangci-lint"
brew "qmk/qmk/qmk"
cask "cyberduck"
cask "dbeaver-community"
cask "eloston-chromium"
cask "firefox"
cask "freecad"
cask "gpg-suite"
cask "insomnia"
cask "kap"
cask "keepassxc"
cask "qlmarkdown"
cask "rectangle"
cask "signal"
cask "slack"
cask "swiftbar"
cask "visual-studio-code"
cask "wezterm-nightly"
cask "zoom"
